#+TITLE:     pad-us_nlcd.org
#+AUTHOR:    Neil Best
#+EMAIL:     nbest@ci.uchicago.edu
#+DATE:      2012-04-13 Fri
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT:

#+PROPERTY: session *R*
#+PROPERTY: results silent

** write out GRASS scripts

#+NAME: grassPuertoRico
#+BEGIN_SRC sh
  ./create_location.sh aeaGrid5minPuertoRico.img PuertoRico grass
  g.rename rast=aeaGrid5minPuertoRico.img,grid_5min
  r.in.gdal input=nlcd2006/pr_landcover_wimperv_10-28-08_se5.img output=nlcd2006
  r.in.gdal input=pad-us/PADUS1_2_regions/PADUS1_2_PuertoRico_GAP.tif output=gap
  
  r.mapcalc MASK="if( nlcd2006 > 0, 1, null())"
  echo grid_5min,nlcd2006,gap,n > statsPuertoRico.csv
  r.stats -c input=grid_5min,nlcd2006,gap fs=, >> statsPuertoRico.csv
  r.mask -r
  echo grid_5min,n > gridPuertoRico.csv
  r.stats -c input=grid_5min fs=, >> gridPuertoRico.csv
  
#+END_SRC


#+NAME: grassCreate( REGION="PuertoRico")
#+BEGIN_SRC sh :session :noweb yes :results output code replace
  # echo ./create_location.sh aeaGrid5min${REGION}.img ${REGION} grass
  
  cat <<'EOF'
  # path to GRASS binaries and libraries:
  export GISBASE=/usr/lib/grass64
  export PATH=$PATH:$GISBASE/bin:$GISBASE/scripts
  export LD_LIBRARY_PATH=$LD_LIBRARY_PATH:$GISBASE/lib
  
  # use process ID (PID) as lock file number:
  export GIS_LOCK=$$
  
  # path to GRASS settings file
  export GISRC=./.grassrc6
  EOF
  
  cat <<EOF
  g.gisenv set=LOCATION_NAME=\$GIS_LOCK
  eval \$(g.gisenv)
  mkdir -p \$GISDBASE/\$GIS_LOCK
  g.mapset -c mapset=temp
  r.in.gdal in=aeaGrid5min${REGION}.img out=grid_5min location=${REGION}
  # g.gisenv set=LOCATION_NAME=${REGION}
  # g.gisenv set=MAPSET=PERMANENT
  g.mapset mapset=PERMANENT location=${REGION}
  rm -rf \$GISDBASE/\$GIS_LOCK/temp
  # g.rename rast=aeaGrid5min${REGION}.img,grid_5min
  r.in.gdal input=pad-us/PADUS1_2_regions/PADUS1_2_${REGION}_GAP.tif output=gap
  EOF
#+END_SRC
  
#+NAME: rInGdalNlcd( region= "PuertoRico")
#+BEGIN_SRC R :results value verbatim replace
  path <-
    list.files( "nlcd2006",
               patt= regionPatterns[[ region]],
               full.names= TRUE)
  sprintf( "r.in.gdal input=%s output=nlcd2006", path)
#+END_SRC

#+RESULTS: rInGdalNlcd
: r.in.gdal input=nlcd2006/pr_landcover_wimperv_10-28-08_se5.img output=nlcd2006


#+NAME: grassMapcalc( REGION= "PuertoRico")
#+BEGIN_SRC sh :session :results output code replace
  cat <<EOF 
  r.mapcalc MASK="if( nlcd2006 > 0, 1, null())"
  echo grid_5min,nlcd2006,gap,n > stats${REGION}.csv
  r.stats -c input=grid_5min,nlcd2006,gap fs=, >> stats${REGION}.csv
  r.mask -r
  echo grid_5min,n > grid${REGION}.csv
  r.stats -c input=grid_5min fs=, >> grid${REGION}.csv
  EOF
  
  cat <<'EOF'
  # run GRASS' cleanup routine
  $GISBASE/etc/clean_temp
  
  # remove session tmp directory:
  rm -rf /tmp/grass6-$USER-$GIS_LOCK
  EOF
#+END_SRC

#+NAME: grassPuertoRico
#+BEGIN_SRC sh :session :noweb yes :tangle grassPuertoRico.sh :shebang "#!/bin/bash -v"
  <<grassCreate( "PuertoRico")>>
  <<rInGdalNlcd( "PuertoRico")>>
  <<grassMapcalc( "PuertoRico")>>
#+END_SRC

#+NAME: grassHawaii
#+BEGIN_SRC sh :session :noweb yes :tangle grassHawaii.sh :shebang "#!/bin/bash -v"
  <<grassCreate( "Hawaii")>>
  <<rInGdalNlcd( "Hawaii")>>
  <<grassMapcalc( "Hawaii")>>
#+END_SRC

#+NAME: grassAlaska
#+BEGIN_SRC sh :session :noweb yes :tangle grassAlaska.sh :shebang "#!/bin/bash -v"
  <<grassCreate( "Alaska")>>
  <<rInGdalNlcd( "Alaska")>>
  <<grassMapcalc( "Alaska")>>
#+END_SRC

#+NAME: grasscUSA
#+BEGIN_SRC sh :session :noweb yes :tangle grasscUSA.sh :shebang "#!/bin/bash -v"
  <<grassCreate( "cUSA")>>
  <<rInGdalNlcd( "cUSA")>>
  <<grassMapcalc( "cUSA")>>
#+END_SRC

